app/controllers/accounts_controller.rb

  def create
    # binding.pry
    if params[:account][:role]=='admin'
      @check_role='admin'
    end
    @account = Account.new(account_params)
    accounts = Account.find_by(email: account_params[:email], is_delete: '0')
    if accounts.present?
      redirect_to new_account_path, notice:'E-mail existed!'
    else
      respond_to do |format|
        @account.is_delete = '0'
        if @account.save
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`email` = 'hoangit.2010@gmail.com' AND `accounts`.`is_delete` = '0' LIMIT 1
INSERT INTO `accounts` (`email`, `password`, `full_name`, `tel`, `address`, `gender`, `image`, `birthday`, `is_delete`, `created_at`, `updated_at`) VALUES ('tamphubkdn@gmail.com', 'Tpnguyen54**', 'tamphubkdn', '090 5566840', 'Hue', 1, 'artist14.jpg', '1992-04-05', 0, '2015-05-26 17:56:32.727908', '2015-05-26 17:56:32.727908')

  def set_account
    @account = Account.find(params[:id])
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 7 LIMIT 1