app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`is_delete` = '0' AND `orders`.`account_id` = 6
---
  def index
    @orders = Order.where(is_delete: '0', account_id: session[:id])

INSERT INTO `orders` (`amount`, `account_id`, `is_delete`, `active_status`, `pay_status`, `ship_status`, `created_at`, `updated_at`) VALUES (9, 7, 0, 0, 0, 0, '2015-05-22 05:06:25.272156', '2015-05-22 05:06:25.272156')
SELECT  `orders`.`id` FROM `orders`  ORDER BY id DESC LIMIT 1
INSERT INTO `orders_details` (`price`, `quantity`, `order_id`, `product_id`, `is_delete`, `created_at`, `updated_at`) VALUES (9, 1, 14, 2, 0, '2015-05-22 05:06:25.434542', '2015-05-22 05:06:25.434542')
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `quantity` = 2, `updated_at` = '2015-05-22 05:06:25.501375' WHERE `products`.`id` = 2
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 7 LIMIT 1
---
  def create
    # render json: params
    @order = Order.new(amount: params[:total] , account_id: session[:id] )
    @order.is_delete =0
    @order.active_status = false
    @order.pay_status = false
    @order.ship_status =false
    if @order.save
      order = Order.select("id").order("id DESC").limit(1)
      session[:cart].each do |s|
        @orders_detail = OrdersDetail.new(price: s[1]["amount"], quantity: s[1]["qty"],
          order_id: order[0]["id"]  , product_id: s[1]["id"])
        @orders_detail.is_delete =0
        @orders_detail.save
        product = Product.find_by(id: s[1]["id"])
        product.quantity = (product.quantity - s[1]["qty"].to_i)
        product.save
      end
      acc = Account.where(id: session[:id])