app/controllers/products_controller.rb

  def index
    @products = Product.search(params[:search]).group('products.id').page(params[:page]).per_page(12)
    @articles = Article.all.where(is_delete: 0)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`is_delete` = 0

  def show
    # @product_images = ProductImage.where('product_id =?', params[:id])
    @product = Product.joins("left JOIN ratings ON ratings.product_id = products.id
      left JOIN product_images ON product_images.product_id = products.id
      left JOIN brands ON brands.id = products.brand_id
      left JOIN categories ON categories.id = products.category_id")
    .select('products.id, products.name, products.price, products.serial, products.height,
       brands.name as brand_name, categories.name as category_name,
     ifnull(DATEDIFF(Now(), products.created_at),0) as new, products.detail, products.created_at,
      IFNULL(products.sale_off,0) as sale, product_images.id as image_id,
      product_images.image, avg(ratings.rating) as rating').find(params[:id])

    @rating = Rating.find_by_account_id(session[:id])
---
SELECT `categories`.`id`, `categories`.`name` FROM `categories` WHERE ((parent_id <> 0 or parent_id <> "null" )
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`account_id` IS NULL LIMIT 1

  def categories_list
    @products = Product.joins("left JOIN ratings ON ratings.product_id = products.id
      left JOIN product_images ON product_images.product_id = products.id")
    .select('products.id, products.name, products.price, DATEDIFF(Now(), products.created_at) as new,
      IFNULL(products.sale_off,0) as sale, product_images.id as image_id,
      product_images.image, avg(ratings.rating) as rating')
    .where('products.is_delete =0 and products.category_id = ?', params[:product_id])
    .group('products.id').order("products.id DESC").page(params[:page]).per_page(12)
---
SELECT `categories`.`id`, `categories`.`name` FROM `categories` WHERE ((parent_id <> 0 or parent_id <> "null" )