app/controllers/ratings_controller.rb

SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`product_id` = 3 LIMIT 1
---
  def create
    @rating = Rating.new(product_id: params[:product_id],
                         account_id: params[:user_id], rating: params[:rating])
    rating = Rating.find_by(product_id: params[:product_id])