app/controllers/ratings_controller.rb

  def create
    # binding.pry

    @rating = Rating.new(product_id: params[:product_id],
                         account_id: params[:user_id], rating: params[:rating])
    # rating = Rating.find_by(product_id: params[:product_id])
    # if rating.present?
    #   redirect_to product_path(params[:product_id]), notice: "Sorry, You've rated!"
    # else
      @rating.save
---
INSERT INTO `ratings` (`product_id`, `account_id`, `rating`, `is_delete`, `created_at`, `updated_at`) VALUES (3, 7, 4, 0, '2015-05-22 04:07:48.675974', '2015-05-22 04:07:48.675974')

  def destroy

    @rating = Rating.find_by_account_id(session[:id])
    @rating.destroy
---
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`account_id` = 9 LIMIT 1
DELETE FROM `ratings` WHERE `ratings`.`id` = 2