app/controllers/sessions_controller.rb

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`email` = 'hoangit.2010@gmail.com' AND `accounts`.`password` = '123456' LIMIT 1
---
  def create
    @account = Account.find_by(email: params[:email], password: params[:password])